H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // Clear any unused space below the last row (list shorter than content zone).
    // Fill full width — the scrollbar will repaint its 6px column when needed.
    if (last_bottom < content_end)
        tft.fillRect(0, last_bottom, scrW(), content_end - last_bottom, bg());

    tft.resetViewport();
    drawScrollBar(item_count, visItems(), first);
    tft.endWrite();
}

// Redraws only the chapter tile grid and scrollbar without touching the header
// or nav bar.  Called directly during scroll drag instead of setting needs_redraw,
// which would trigger a full drawChapterSelect() → fillScreen() → flash next loop.
// startWrite / endWrite batches all SPI transfers in one transaction for speed.
void BibleInterface::redrawChapterContent() {
    uint16_t  chaps      = bookChapters(cur_book);
    uint16_t tile_w     = scrW() / 5;
    uint16_t tile_h     = 36;
    uint8_t  vis_rows   = (uint8_t)(contentH() / tile_h);
    int16_t  total_rows = ((int16_t)chaps + 4) / 5;

    tft.startWrite();
    // Each tile fills its own background; no global clear (prevents flash).
    // Clip to content zone so tiles never bleed into header or nav.
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    for (uint8_t row = 0; row < vis_rows; row++) {
        for (uint8_t col = 0; col < 5; col++) {
            uint16_t ch = (uint16_t)((menu_scroll + row) * 5 + col + 1);
            uint16_t x = col * tile_w;
            uint16_t y = contentY() + row * tile_h;
            if (ch > chaps) {
                // Clear unused tile slots to the right in the last row
                if (x < scrW() - 6)
                    tft.fillRect(x, y, scrW() - 6 - x, tile_h, bg());
                break;
            }
            bool     sel     = (ch == cur_chapter) || (ch == (int16_t)menu_sel);
            uint16_t tile_bg = sel ? sel_bg() : bg();
            tft.fillRect(x, y, tile_w, tile_h, tile_bg);
            tft.drawRect(x, y, tile_w, tile_h, dark_mode ? 0x2104 : 0xC618);
            char buf[5];
            snprintf(buf, sizeof(buf), "%d", ch);
            tft.setTextColor(fg(), tile_bg);
            tft.drawCentreString(buf, x + tile_w / 2, y + (tile_h - 16) / 2, 2);
        }
    }
    // Clear any gap below the tile rows
    uint16_t used_h = (uint16_t)vis_rows * tile_h;
    if (used_h < contentH())
        tft.fillRect(0, contentY() + used_h, scrW() - 6, contentH() - used_h, bg());

    tft.resetViewport();
    drawScrollBar(total_rows, vis_rows, menu_scroll);
    tft.endWrite();
}

// ─────────────────────────────────────────────────────────────────────────────
// Translation select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawTransSelect() {
    tft.fillScreen(bg());
    const char* title = (mode == MODE_SONGS) ? "Choose Songbook"
                      : (mode == MODE_DICT)  ? "Choose Dictionary"
                                             : "Choose Translation";
    drawHeader(title, true);
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < trans_count; i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), trans_stems[menu_scroll + i], sel);
    }
    drawScrollBar(trans_count, vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Section select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawSectionSelect() {
    tft.fillScreen(bg());
    drawHeader(trans_count > 0 ? trans_stems[cur_trans] : "Bible", true);
    // Scroll-aware: Songs can have many categories (sections), so honor menu_scroll
    // and draw a scrollbar (Bible's 4 sections always fit).
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < numSecs(); i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), secName(menu_scroll + i), sel);
    }
    drawScrollBar(numSecs(), vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Book select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawBookSelect() {
    tft.fillScreen(bg());
    drawHeader(secName(cur_sec));
    uint8_t vis   = visItems();
    uint16_t start = secStart(cur_sec);
    uint16_t count = secLen(cur_sec);
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < count; i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), bookDisplay(start + menu_scroll + i), sel);
    }
    drawScrollBar(count, vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Chapter select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawChapterSelect() {
    tft.fillScreen(bg());
    drawHeader(bookDisplay(cur_book));

    uint16_t  chaps    = bookChapters(cur_book);
    uint16_t tile_w   = scrW() / 5;
    uint16_t tile_h   = 36;
    uint8_t  vis_rows = (uint8_t)(contentH() / tile_h);

    for (uint8_t row = 0; row < vis_rows; row++) {
        for (uint8_t col = 0; col < 5; col++) {
            uint16_t ch = (uint16_t)((menu_scroll + row) * 5 + col + 1);
            if (ch > chaps) break;

            uint16_t x  = col * tile_w;
            uint16_t y  = contentY() + row * tile_h;
            bool     sel = (ch == cur_chapter) || (ch == (int16_t)menu_sel);

            uint16_t tile_bg = sel ? sel_bg() : bg();
            tft.fillRect(x, y, tile_w, tile_h, tile_bg);
            tft.drawRect(x, y, tile_w, tile_h, dark_mode ? 0x2104 : 0xC618);

            char buf[5];
            snprintf(buf, sizeof(buf), "%d", ch);
            tft.setTextColor(fg(), tile_bg);
            tft.drawCentreString(buf, x + tile_w / 2, y + (tile_h - 16) / 2, 2);
        }
    }

