H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // Delete (right) — red border + red text to signal destructive action
    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    tft.setTextColor(TFT_RED, hdr_bg());
    tft.drawCentreString("Delete", del_x + half_w / 2, btn_y + (btn_h - 8) / 2, 1);
}

// ─────────────────────────────────────────────────────────────────────────────
// Touch input
// ─────────────────────────────────────────────────────────────────────────────
bool BibleInterface::getTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    uint8_t touches = ft6336_update(&raw_x, &raw_y);
    if (touches == 0) { last_pressed = false; return false; }
    // FT6336 returns coordinates in panel orientation; rotation=0 portrait
    *tx = raw_x;
    *ty = raw_y;
#else
    uint16_t cal[5] = {0,0,0,0,0}; // use default calibration
    (void)cal;
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    uint32_t now = millis();
    if (last_pressed && (now - last_input_ms) < 200) return false;
    last_pressed   = true;
    last_input_ms  = now;
    return true;
}

// Raw touch poll — no debounce, used for gesture detection in list views.
bool BibleInterface::pollTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    if (!ft6336_update(&raw_x, &raw_y)) { last_pressed = false; return false; }
    *tx = raw_x; *ty = raw_y;
#else
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    last_pressed  = true;
    last_input_ms = millis();
    return true;
}

bool BibleInterface::touchInHeader(uint16_t /*x*/, uint16_t y) {
    return y < hdrH();
}

#ifndef HAS_CAP_TOUCH
// Run the TFT_eSPI resistive-touch calibration wizard.
// Loops until the user correctly taps a verification circle, then saves
// the resulting 5-word calibration array to Preferences ("tcal2"/"tcald2").
// blInit() must have been called before this so the LEDC channel is attached.
void BibleInterface::runTouchCalibration() {
    // Force full brightness — stored level may be very low.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(TFT_BL, 255);
#else
    ledcWrite(0, 255);
#endif

    bool success = false;
    while (!success) {
        // ── Instructions screen ──────────────────────────────────────────
        tft.fillScreen(TFT_BLACK);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawCentreString("Touch Calibration", scrW() / 2, scrH() / 2 - 20, 2);
        tft.drawCentreString("Tap each + marker", scrW() / 2, scrH() / 2 +  5, 2);
        delay(2000);

        // ── 4-corner calibration ─────────────────────────────────────────
        uint16_t calData[5];
        tft.calibrateTouch(calData, TFT_WHITE, TFT_BLACK, 15);
        tft.setTouch(calData);  // apply immediately for verification

        // ── Verification: tap the green circle ───────────────────────────
        int16_t cx = scrW() / 2;
        int16_t cy = scrH() / 2 + 20;
        tft.fillScreen(TFT_BLACK);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawCentreString("Tap the circle", scrW() / 2, cy - 55, 2);
        tft.drawCircle(cx, cy, 22, TFT_GREEN);
        tft.fillCircle(cx, cy,  8, TFT_GREEN);

        uint16_t vx = 0, vy = 0;
        bool tapped = false;
        uint32_t t0 = millis();
        while (millis() - t0 < 6000) {
            if (tft.getTouch(&vx, &vy, 600)) { tapped = true; break; }
            delay(20);
        }

        if (tapped && abs((int16_t)vx - cx) < 35 && abs((int16_t)vy - cy) < 35) {
            // ── Good — save ───────────────────────────────────────────────
            prefs.putBytes("tcald2", calData, sizeof(calData));
            prefs.putUChar("tcal2", 1);
            success = true;
        } else {
            // ── Bad or timeout — try again ────────────────────────────────
            tft.fillScreen(TFT_BLACK);
            tft.setTextColor(TFT_RED, TFT_BLACK);
            tft.drawCentreString("Calibration failed", scrW() / 2, scrH() / 2 - 8, 2);
            tft.drawCentreString("Try again...",       scrW() / 2, scrH() / 2 + 16, 2);
            delay(2000);
        }
    }

    // Restore user's saved brightness level.
    blSet(bl_idx);
    tft.fillScreen(bg());
}
#endif
bool BibleInterface::touchInNav(uint16_t /*x*/, uint16_t y) {
    return y >= (scrH() - navH());
}
int16_t BibleInterface::touchItem(uint16_t /*x*/, uint16_t y) {
    if (y < contentY() || y >= (scrH() - navH())) return -1;
    return (int16_t)((y - contentY()) / itemH());
}

// ─────────────────────────────────────────────────────────────────────────────
// Input handlers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::handleListInput(uint16_t item_count) {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ─────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        // Header and nav bar fire immediately on press — no drag ambiguity there
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if      (tx > scrW() - scrW()/3) { blCycle(); needs_redraw = true; }
            else if (tx < scrW()/3)           { goToBookmarks(); }
            else                               { goToSettings(); }
            return;
        }
        // Highlight the touched item immediately for press feedback
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (menu_scroll + hi) < (int16_t)item_count) {
            menu_sel = menu_scroll + hi;
            redrawListContent(item_count);
        }
        return;
    }

