H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // ── Finger held — pixel-accurate drag ────────────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            menu_sel = -1;  // clear press highlight when drag begins
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)item_count - (int)visItems()) * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px   = new_px;
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawListContent(item_count);
        }
        return;
    }

    // ── Finger lifted ────────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            // Kick fling if lift velocity is fast enough
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // It was a tap — navigate to the item highlighted on press
        if (menu_sel < 0 || menu_sel >= (int16_t)item_count) return;

        switch (view) {
            case BV_TRANS_SELECT:
                selectTranslation((uint16_t)menu_sel);
                break;
            case BV_SECTION_SELECT:
                goToBook((int16_t)menu_sel);
                break;
            case BV_BOOK_SELECT:
                goToChapter(secStart(cur_sec) + (int16_t)menu_sel);
                break;
            case BV_CHAPTER_SELECT:
                goToReading((int16_t)menu_sel + 1);
                break;
            default: break;
        }
    }
}

void BibleInterface::handleChapterInput() {
    uint16_t  chaps      = bookChapters(cur_book);
    uint16_t tile_w     = scrW() / 5;
    uint16_t tile_h     = 36;
    uint8_t  vis_rows   = (uint8_t)(contentH() / tile_h);
    int16_t  total_rows = ((int16_t)chaps + 4) / 5;
    int16_t  max_scroll = max((int16_t)0, (int16_t)(total_rows - vis_rows));

    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = (float)menu_scroll * (float)tile_h;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if      (tx > scrW() - scrW()/3) { blCycle(); needs_redraw = true; }
            else if (tx < scrW()/3)           { goToBookmarks(); }
            else                               { goToSettings(); }
            return;
        }
        // Highlight the touched chapter tile immediately for press feedback
        if (ty >= (uint16_t)contentY() && ty < (uint16_t)(scrH() - navH())) {
            uint8_t col_p = (uint8_t)(tx / tile_w);
            uint8_t row_p = (uint8_t)((ty - contentY()) / tile_h);
            uint16_t ch_p  = (uint16_t)((menu_scroll + row_p) * 5 + col_p + 1);
            if (ch_p >= 1 && ch_p <= chaps) {
                menu_sel = (int16_t)ch_p;
                redrawChapterContent();
            }
        }
        return;
    }

    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 12) {
            scroll_dragging = true;
            menu_sel = -1;  // clear tile highlight when drag begins
        }
        if (scroll_dragging) {
            // Chapter grid stays quantized during drag
            float raw_px   = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            float max_px   = (float)max_scroll * (float)tile_h;
            if (raw_px < 0.f) raw_px = 0.f;
            if (raw_px > max_px) raw_px = max_px;
            scroll_px = raw_px;
            int16_t new_scroll = (int16_t)(scroll_px / (float)tile_h);
            recordVel((int16_t)ty, millis());
            if (new_scroll != menu_scroll) {
                menu_scroll = new_scroll;
                redrawChapterContent();
            }
        }
        return;
    }

    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // Navigate to the chapter highlighted on press
        if (menu_sel < 1 || menu_sel > (int16_t)chaps) return;
        goToReading((int16_t)menu_sel);
    }
}

void BibleInterface::handleReadingInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched ────────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            uint16_t third = scrW() / 3;
            if (tx < third)      { goToBookmarks();      return; }
            if (tx < 2 * third)  { goToSettings();       return; }
            addBookmarkCurrent(); return;
        }
        return;
    }

