H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // ── Finger held down — pixel-accurate drag ────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) scroll_dragging = true;
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)line_count - (int)visLines()) * (float)lineH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px = new_px;
            recordVel((int16_t)ty, millis());
            drawReadingLines();  // updates read_line internally from scroll_px
        }
        return;
    }

    // ── Finger lifted ─────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }
        // Tap without drag ─────────────────────────────────────────────────
        // If tap is in the verse-number column (x < 55) and in the content
        // area, toggle verse selection instead of doing page navigation.
        if ((int16_t)touch_down_x < 55
                && (int16_t)touch_down_y >= (int16_t)contentY()
                && (int16_t)touch_down_y < (int16_t)(contentY() + contentH())) {
            // Determine which line was tapped
            int16_t sub_px   = (int16_t)fmodf(scroll_px, (float)lineH());
            int16_t first_ln = (int16_t)(scroll_px / (float)lineH());
            int16_t row_off  = ((int16_t)touch_down_y - (int16_t)contentY() + sub_px) / (int16_t)lineH();
            int16_t line_idx = first_ln + row_off;

            // Scan backward from tapped line to find the owning verse number
            uint8_t v = 0;
            for (int16_t k = line_idx; k >= 0; k--) {
                if (k < (int16_t)line_count && lines[k][0] == '^') {
                    const char* pipe = strchr(lines[k] + 1, '|');
                    if (pipe) { v = (uint8_t)atoi(lines[k] + 1); break; }
                }
            }

            if (v > 0) {
                if (sel_verse_first == 0) {
                    // Nothing selected → select this verse
                    sel_verse_first = sel_verse_last = v;
                } else if (v >= sel_verse_first && v <= sel_verse_last) {
                    // Tap on already-selected verse
                    if (sel_verse_first == sel_verse_last) {
                        sel_verse_first = sel_verse_last = 0;  // deselect single
                    } else if (v == sel_verse_first) {
                        sel_verse_first++;                      // shrink from start
                    } else if (v == sel_verse_last) {
                        sel_verse_last--;                       // shrink from end
                    } else {
                        sel_verse_first = sel_verse_last = v;  // middle → reset to this
                    }
                } else if (v == sel_verse_last + 1) {
                    sel_verse_last = v;                         // extend end
                } else if (v + 1 == sel_verse_first) {
                    sel_verse_first = v;                        // extend start
                } else {
                    sel_verse_first = sel_verse_last = v;       // non-adjacent → reset
                }
                drawReadingLines();
                return;
            }
        }

        // Upper half = previous page/chapter, lower = next
        uint16_t mid = scrH() / 2;
        if (touch_down_y < mid) {
            int16_t prev = read_line - (int16_t)visLines();
            if (prev >= 0) {
                scroll_px = (float)prev * (float)lineH();
                drawReadingLines();
            } else if (scroll_px > 0.f) {
                scroll_px = 0.f;
                drawReadingLines();
            } else if (cur_chapter > 1) {
                goToReading(cur_chapter - 1);
            }
        } else {
            int16_t next = read_line + (int16_t)visLines();
            if (next < (int16_t)line_count) {
                scroll_px = (float)next * (float)lineH();
                drawReadingLines();
            } else if (cur_chapter < bookChapters(cur_book)) {
                goToReading(cur_chapter + 1);
            }
        }
    }
}

void BibleInterface::handleSettingsInput() {
#ifdef HAS_CAP_TOUCH
    const uint8_t SETTINGS_N = 6;
#else
    const uint8_t SETTINGS_N = 7;
#endif
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ──────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down = true;
        touch_down_x   = tx;
        touch_down_y   = ty;

        // Header and nav fire immediately on press (no drag ambiguity)
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) goBack();
            return;
        }
        // Highlight touched item immediately for press feedback (partial redraw, no fillScreen)
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && hi < (int16_t)SETTINGS_N) {
            menu_sel = hi;
            redrawSettingsContent();
        }
        return;
    }

    // ── Finger held — no drag in settings ────────────────────────────────────
    if (down && touch_was_down) return;

    // ── Finger lifted — activate the item highlighted on press ───────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (menu_sel < 0 || menu_sel >= (int16_t)SETTINGS_N) return;

