H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        switch (menu_sel) {
            case 0: // Font size
                font_num = (font_num == 1) ? 2 : (font_num == 2) ? 4 : 1;
                prefs.putUChar("font", font_num);
                redrawSettingsContent();
                break;
            case 1: // Theme — bg/header/nav all change, repaint each zone without fillScreen
                dark_mode = !dark_mode;
                prefs.putBool("dark", dark_mode);
                drawHeader("Settings");
                redrawSettingsContent();
                // Clear any empty content area below the settings rows
                {
                    int16_t empty_y = contentY() + (int16_t)SETTINGS_N * (int16_t)itemH();
                    int16_t empty_h = (int16_t)contentH() - (int16_t)SETTINGS_N * (int16_t)itemH();
                    if (empty_h > 0) tft.fillRect(0, empty_y, scrW(), empty_h, bg());
                }
                drawNavBar("Back", "", "");
                break;
            case 2: // Brightness — [+] button starts at scrW()-32; everything left = [-]
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32) {
                    if (bl_idx < 19) blSet(bl_idx + 1);
                } else {
                    if (bl_idx > 0)  blSet(bl_idx - 1);
                }
                redrawSettingsContent();
                break;
            case 3: // Translation cycle
                if (trans_count > 1) {
                    cur_trans = (cur_trans + 1) % trans_count;
                    prefs.putUChar("trans", cur_trans);
                    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
                    book_idx_valid = false;
                    if (mode != MODE_BIBLE) {
                        // Load the newly-selected file's structure so navigation
                        // back into it is valid.
                        if (loadToc(trans_stems[cur_trans])) {
                            if (cur_book >= numBooks()) cur_book = 0;
                            cur_sec     = (numBooks() > 0) ? bookSection(cur_book) : 0;
                            cur_chapter = 1;
                        }
                    } else if (cur_book >= numBooks()) {
                        cur_book = 0;
                    }
                }
                redrawSettingsContent();
                break;
            case 4: // Highlight — [>] forward, [<] backward (boundary at scrW()-32)
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32)
                    accent_idx = (uint8_t)((accent_idx + 1) % ACCENT_COUNT);
                else
                    accent_idx = (accent_idx == 0) ? ACCENT_COUNT - 1 : accent_idx - 1;
                prefs.putUChar("accent", accent_idx);
                redrawSettingsContent();
                break;
            case 5: // Boot Marauder
                bootMarauder();
                return;
#ifndef HAS_CAP_TOUCH
            case 6: // Calibrate Touch
                runTouchCalibration();
                drawSettings();
                return;
#endif
        }
    }
}

void BibleInterface::handleBookmarksInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Delete confirmation popup ─────────────────────────────────────────────
    // While the popup is visible, block all normal list input and only act on
    // a tap inside the Delete button (anywhere else = Cancel).
    if (bm_confirm_pending) {
        if (down && !touch_was_down) {
            touch_was_down = true;
            touch_down_x = tx;   // save position — pollTouch doesn't write tx/ty on lift
            touch_down_y = ty;
        } else if (!down && touch_was_down) {
            touch_was_down = false;
            // Recompute Delete button bounds (must match drawConfirmDelete)
            int16_t pop_w  = (int16_t)scrW() - 40;
            int16_t pop_y  = (int16_t)(scrH() / 2) - 40;
            int16_t btn_y  = pop_y + 44;
            int16_t btn_h  = 28;
            int16_t half_w = pop_w / 2 - 6;
            int16_t del_x  = 20 + pop_w / 2 + 2;
            // Use saved down-position — tx/ty are stale on lift (pollTouch returns false)
            bool in_del = ((int16_t)touch_down_x >= del_x && (int16_t)touch_down_x < del_x + half_w &&
                           (int16_t)touch_down_y >= btn_y  && (int16_t)touch_down_y < btn_y + btn_h);
            if (in_del && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                for (uint8_t i = (uint8_t)bm_sel; i < bm_count - 1; i++)
                    bookmarks[i] = bookmarks[i + 1];
                bm_count--;
                if (bm_sel >= (int16_t)bm_count && bm_sel > 0) bm_sel--;
                saveBookmarks();
            }
            bm_confirm_pending = false;
            needs_redraw = true;
        }
        return;
    }

    // ── Finger just touched down ─────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) {
                goBack(); return;
            } else if (tx > 2*(scrW()/3)) {
                // "Del" — show confirmation popup
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    bm_confirm_pending = true;
                    needs_redraw = true;
                }
            } else {
                // "View" — navigate to the selected bookmark
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    jumpToBookmark((uint8_t)bm_sel);
                }
            }
            return;
        }
        // Highlight the touched bookmark immediately for press feedback
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (bm_scroll + hi) < (int16_t)bm_count) {
            bm_sel = bm_scroll + hi;
            redrawListContent(bm_count);
        }
        return;
    }

