H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Decode common XML entities in-place
void BibleInterface::xmlDecodeEntities(char* buf, size_t len) {
    struct { const char* ent; char ch; } map[] = {
        { "&amp;", '&' }, { "&lt;", '<' }, { "&gt;", '>' },
        { "&apos;", '\'' }, { "&quot;", '"' }, { "&nbsp;", ' ' },
        { nullptr, 0 }
    };
    for (size_t i = 0; i < len && buf[i]; i++) {
        if (buf[i] != '&') continue;
        for (int m = 0; map[m].ent; m++) {
            size_t elen = strlen(map[m].ent);
            if (strncmp(buf + i, map[m].ent, elen) == 0) {
                buf[i] = map[m].ch;
                memmove(buf + i + 1, buf + i + elen, len - i - elen);
                break;
            }
        }
    }
}

// Compress 2-byte UTF-8 German sequences to private single-byte codes:
//   0x80=Ä  0x81=ä  0x82=Ö  0x83=ö  0x84=Ü  0x85=ü  0x86=ß (pixel-drawn)
// All other unrecognised multi-byte sequences: lead byte is kept, trail byte dropped.
// Uses read/write pointers so no additional buffer is needed.
void BibleInterface::utf8Encode(char* buf) {
    static const struct { uint8_t b1, b2, code; } map[] = {
        { 0xC3, 0x84, 0x80 },  // Ä
        { 0xC3, 0xA4, 0x81 },  // ä
        { 0xC3, 0x96, 0x82 },  // Ö
        { 0xC3, 0xB6, 0x83 },  // ö
        { 0xC3, 0x9C, 0x84 },  // Ü
        { 0xC3, 0xBC, 0x85 },  // ü
    };
    char* r = buf;
    char* w = buf;
    while (*r) {
        uint8_t b = (uint8_t)*r;
        if (b >= 0x80 && r[1]) {
            // ß → private code 0x86 (2 UTF-8 bytes → 1 private byte)
            if (b == 0xC3 && (uint8_t)r[1] == 0x9F) {
                *w++ = (char)0x86; r += 2; continue;
            }
            bool found = false;
            for (uint8_t i = 0; i < 6; i++) {
                if (b == map[i].b1 && (uint8_t)r[1] == map[i].b2) {
                    *w++ = (char)map[i].code; r += 2; found = true; break;
                }
            }
            if (!found) *w++ = *r++;   // unknown sequence: keep lead byte
        } else {
            *w++ = *r++;
        }
    }
    *w = 0;
}

// Measure pixel width of a string that may contain private codes 0x80-0x86.
// Substitutes the base letter for measurement (widths are nearly identical).
int16_t BibleInterface::textWidthUTF8(const char* str, uint8_t font) {
    static const char bases[] = {'A','a','O','o','U','u'};
    char tmp[BIBLE_LINE_BUF];
    size_t j = 0;
    for (const char* p = str; *p && j < BIBLE_LINE_BUF - 1; p++) {
        uint8_t c = (uint8_t)*p;
        if      (c >= 0x80 && c <= 0x85) tmp[j++] = bases[c - 0x80];
        else if (c == 0x86)               tmp[j++] = 'B';  // ß ≈ B width
        else                              tmp[j++] = *p;
    }
    tmp[j] = 0;
    return tft.textWidth(tmp, font);
}

// Draw a string that may contain private codes 0x80-0x86.
// Umlauts (0x80-0x85): base letter + two diaeresis dots via bibleDrawUmlautDots().
// ß (0x86): pixel-drawn glyph via bibleDrawSzlig().
void BibleInterface::drawStringUTF8(TFT_eSprite& spr, const char* str, int16_t x, int16_t y,
                                     uint8_t font, uint16_t color) {
    static const char bases[] = {'A','a','O','o','U','u'};

    for (const char* p = str; *p; p++) {
        uint8_t c = (uint8_t)*p;
        if (c == 0x86) {
            x += bibleDrawSzlig(spr, x, y, font, color);
        } else if (c >= 0x80 && c <= 0x85) {
            int16_t w    = spr.drawChar((uint16_t)bases[c - 0x80], x, y, font);
            bool is_lower = ((c - 0x80) & 1) != 0;  // 0x81/0x83/0x85 = ä/ö/ü
            bibleDrawUmlautDots(spr, x, y, w, is_lower, font, color);
            x += w;
        } else {
            x += spr.drawChar((uint16_t)(uint8_t)*p, x, y, font);
        }
    }
}

// Render ß (private code 0x86) as a pixel-drawn glyph matching each font size.
// Returns the advance width (pixels to next character).
//
// Glyph designs (y = top of character cell, same coordinate as drawChar):
//
//   Font 1 (GLCD 8px) — 6-col canvas, advance 6
//     .##...   row 0  top arch
//     #..#..   row 1  open counters
//     #..#..   row 2
//     #.#...   row 3  diagonal mid-junction
//     #..#..   row 4
//     #...#.   row 5  lower lobe widens
//     #...#.   row 6
//     ..##..   row 7  bottom tail
//
//   Font 2 (Font16 16px) — 8-col canvas, advance 8
//     .###....  row 3  top arch (3px)
//     #...#...  row 4  open counters
//     ...
//     #.##....  row 7  mid junction (cols 2-3)
//     #...#...  row 8
//     #....#..  rows 9-11  lower lobe widens to col 5
//     #...#...  row 12
//     ..##....  row 13 bottom tail
//
//   Font 4 (Font32 26px) — 13-col canvas, advance 13
//     Smooth curved ß: 2px-wide left stem (cols 1-2, rows 5-17),
//     rounded upper loop, rounded lower lobe, curved bottom tail.
int16_t BibleInterface::drawSzlig(TFT_eSprite& spr, int16_t x, int16_t y,
                                   uint8_t font, uint16_t color) {
    return bibleDrawSzlig(spr, x, y, font, color);
}

// Extract attribute value from a tag string like:  verse osisID="Gen.1.1"
bool BibleInterface::xmlGetAttr(const char* tag, const char* attr, char* out, size_t out_len) {
    const char* p = strstr(tag, attr);
    if (!p) return false;
    p += strlen(attr);
    while (*p == ' ') p++;
    if (*p != '=') return false;
    p++;
    while (*p == ' ') p++;
    char delim = (*p == '"' || *p == '\'') ? *p++ : ' ';
    size_t n = 0;
    while (*p && *p != delim && n < out_len - 1)
        out[n++] = *p++;
    out[n] = 0;
    return (n > 0);
}

bool BibleInterface::cacheChapter(uint16_t book, uint16_t chapter) {
    if (cached_book == book && cached_chap == chapter) return (cached_count > 0);
    cached_count = 0;
    cached_book  = book;
    cached_chap  = chapter;

    if (trans_count == 0 || book >= numBooks()) return false;

    // ── Book byte-offset index ─────────────────────────────────────────────
    // Bible: load (or build+save) the .idx so we can seek directly to a book.
    // Songs/Dict: book_offsets[] is already filled by loadToc() (no .idx scan).
    if (mode == MODE_BIBLE && (!book_idx_valid || book_idx_trans != cur_trans)) {
        if (!loadBookIndex(trans_stems[cur_trans])) {
            buildBookIndex(trans_stems[cur_trans]);
            saveBookIndex(trans_stems[cur_trans]);
        }
        book_idx_valid = true;
        book_idx_trans = cur_trans;
    }

    // Build file path: /bible/<stem>.xml
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[cur_trans]);

    File f = SD.open(path);
    if (!f) {
        Serial.print(F("[Bible] Cannot open ")); Serial.println(path);
        return false;
    }

    // Seek to the book's starting byte — skips all preceding books
    if (book_offsets[book] > 0)
        f.seek(book_offsets[book]);

    // Build the osisID prefix we are looking for: "Book.Chapter."
    // e.g. "Gen.1." for Genesis chapter 1
    char prefix[32];
    snprintf(prefix, sizeof(prefix), "%s.%d.", bookCode(book), chapter);
    size_t prefix_len = strlen(prefix);

    // Build the osisID prefix for the NEXT chapter so we know when to stop
    char next_prefix[32];
    snprintf(next_prefix, sizeof(next_prefix), "%s.%d.", bookCode(book), chapter + 1);

