H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    XmlState s;
    memset(&s, 0, sizeof(s));
    s.f          = f;
    s.chunk_len  = 0;
    s.chunk_pos  = 0;
    s.in_verse   = false;
    s.in_note    = false;
    s.nest_level = 0;
    s.collecting = false;
    s.verse_text_len = 0;

    // State machine
    // States: outside tag, inside tag, inside verse text, inside note
    enum { ST_TEXT, ST_TAG } st = ST_TEXT;
    char c;
    char tag_buf[XML_TAG_BUF];
    int  tag_len = 0;
    bool done    = false;

    while (!done && xmlNextByte(s, c)) {
        if (st == ST_TEXT) {
            if (c == '<') {
                st = ST_TAG;
                tag_len = 0;
                continue;
            }
            // Collect text if we are inside a target verse and not in a note
            if (s.in_verse && !s.in_note && s.collecting) {
                if (s.verse_text_len < BIBLE_VERSE_BUF - 2) {
                    s.verse_text[s.verse_text_len++] = c;
                }
            }
        } else { // ST_TAG
            if (c == '>') {
                st = ST_TEXT;
                tag_buf[tag_len] = 0;

                bool closing = (tag_buf[0] == '/');
                const char* tname = closing ? tag_buf + 1 : tag_buf;

                // Skip XML declaration, comments, DOCTYPE
                if (tag_buf[0] == '?' || tag_buf[0] == '!') {
                    tag_len = 0; continue;
                }

                if (!closing) {
                    // Opening or self-closing tag
                    bool self_close = (tag_len > 0 && tag_buf[tag_len-1] == '/');
                    if (self_close) { tag_buf[tag_len-1] = 0; }

                    // Is this a <verse ...> tag?
                    if (strncmp(tname, "verse", 5) == 0 &&
                        (tname[5] == ' ' || tname[5] == '\t' || tname[5] == 0)) {
                        char osis_id[64] = {0};
                        if (xmlGetAttr(tag_buf, "osisID", osis_id, sizeof(osis_id))) {
                            if (strncmp(osis_id, prefix, prefix_len) == 0) {
                                // This is a verse we want
                                s.in_verse = true;
                                s.nest_level = 1;
                                s.verse_text_len = 0;
                                s.in_note = false;
                                s.collecting = !self_close;
                                if (self_close) {
                                    // Self-closing verse with no text (rare)
                                    s.in_verse = false;
                                }
                            } else if (strncmp(osis_id, next_prefix, strlen(next_prefix)) == 0) {
                                // We've gone past our chapter — stop
                                done = true;
                            } else if (cached_count > 0) {
                                // A verse from a different book/chapter appeared after
                                // we already collected ours — we're done. (Verses are
                                // contiguous, so this is the safe stop for the last
                                // chapter of a book and for single-chapter songs.)
                                done = true;
                            }
                        }
                    } else if (s.in_verse) {
                        // Tag inside a verse
                        if (strncmp(tname, "note", 4) == 0) {
                            s.in_note = true;
                        }
                        if (!self_close) s.nest_level++;
                    }
                } else {
                    // Closing tag
                    if (strncmp(tname, "verse", 5) == 0 && s.in_verse) {
                        // End of verse — save it
                        s.verse_text[s.verse_text_len] = 0;
                        xmlDecodeEntities(s.verse_text, BIBLE_VERSE_BUF);
                        utf8Encode(s.verse_text);
                        // Trim trailing whitespace
                        int vlen = strlen(s.verse_text);
                        while (vlen > 0 && (s.verse_text[vlen-1] == ' ' ||
                               s.verse_text[vlen-1] == '\n' ||
                               s.verse_text[vlen-1] == '\r')) {
                            s.verse_text[--vlen] = 0;
                        }
                        if (cached_count < BIBLE_MAX_VERSES_CACHED) {
                            strncpy(verse_buf[cached_count], s.verse_text, BIBLE_VERSE_BUF - 1);
                            verse_buf[cached_count][BIBLE_VERSE_BUF - 1] = 0;
                            cached_count++;
                        }
                        s.in_verse = false;
                        s.in_note  = false;
                        s.nest_level = 0;
                        s.collecting = false;
                    } else if (s.in_verse) {
                        if (strncmp(tname, "note", 4) == 0) s.in_note = false;
                        if (s.nest_level > 1) s.nest_level--;
                    }
                }
                tag_len = 0;
            } else {
                if (tag_len < XML_TAG_BUF - 1)
                    tag_buf[tag_len++] = c;
            }
        }
    }

    f.close();
    Serial.printf("[Bible] Cached %d verses for %s ch %d\n",
                  cached_count, bookDisplay(book), chapter);
    return (cached_count > 0);
}

// ─────────────────────────────────────────────────────────────────────────────
// Text wrapping — builds lines[] from verse_buf[]
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::buildWrappedLines() {
    line_count = 0;
    uint16_t max_px = scrW() - 14;  // 4px left pad + 10px right pad

    for (uint8_t v = 0; v < cached_count && line_count < BIBLE_MAX_LINES; v++) {
        addWrappedLine(v + 1, verse_buf[v], max_px, font_num, line_count);
    }
}

void BibleInterface::addWrappedLine(uint8_t verse_num, const char* text,
                                     uint16_t max_px, uint8_t fnt, uint16_t& idx) {
    const char* p            = text;
    bool        is_first_line = true;   // true only for the verse's first screen line

    // For the verse-first line the verse number prefix is drawn to the left of the
    // content text, so the available content width is narrowed by its pixel width.
    uint16_t first_max_px = max_px;
    if (verse_num > 0) {
        char num_str[12];
        snprintf(num_str, sizeof(num_str), "%d.", verse_num);
        int16_t num_w = textWidthUTF8(num_str, fnt) + 2;  // +2px gap
        first_max_px  = (num_w < (int16_t)max_px) ? (uint16_t)(max_px - num_w) : 0;
    }

    while (*p && idx < BIBLE_MAX_LINES) {
        char* out     = lines[idx];
        int   out_len = 0;

