H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::drawSearchDelConfirm() {
    int16_t pop_w = (int16_t)scrW() - 40;
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete from history?", scrW() / 2, pop_y + 10, 2);

    int16_t btn_y  = pop_y + 44;
    int16_t btn_h  = 28;
    int16_t half_w = pop_w / 2 - 6;
    int16_t del_x  = pop_x + pop_w / 2 + 2;

    tft.fillRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, dim_fg());
    tft.setTextColor(TFT_WHITE, hdr_bg());
    tft.drawCentreString("Cancel", pop_x + 4 + half_w / 2, btn_y + (btn_h - 8) / 2, 1);

    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    tft.setTextColor(TFT_RED, hdr_bg());
    tft.drawCentreString("Delete", del_x + half_w / 2, btn_y + (btn_h - 8) / 2, 1);
}

// Draws one search result row: reference on top line, snippet (with highlighted
// query text) on second line.  y_px is the absolute screen Y of the row top.
// Drawing is clipped by any active TFT viewport (set by redrawSearchResultsContent).
void BibleInterface::drawSearchResultRow(int16_t y_px, uint16_t idx, bool sel) {
    const int16_t SBAR_W  = 6;
    const int16_t PADDING = 4;
    int16_t row_w = (int16_t)scrW() - SBAR_W;
    int16_t row_h = (int16_t)srchH();

    uint16_t bg_col = sel ? sel_bg() : bg();
    tft.fillRect(0, y_px, row_w, row_h, bg_col);
    // Divider line at bottom of row
    tft.drawFastHLine(0, y_px + row_h - 1, row_w, dim_fg());

    // Reference "Book Ch:Vs" in font 2 (16px)
    {
        BibleSearchResult& r = search_results[idx];
        char ref[40];
        snprintf(ref, sizeof(ref), "%s %d:%d",
                 bookDisplay(r.book), (int)r.chapter, (int)r.verse);
        tft.setTextColor(fg(), bg_col);
        tft.setTextDatum(TL_DATUM);
        tft.drawString(ref, PADDING, y_px + 3, 2);
    }

    // Snippet in font 1 (8px) with highlighted query segments.
    // disp/qdisp hold ASCII base letters (for case-insensitive match); snip holds
    // the original private codes so rendering shows proper umlauts/ß.
    // Private codes are 1-byte just like ASCII, so indices are identical between
    // snip and disp — we match on disp, render from snip.
    int16_t snip_y = y_px + 23;
    const char* snip = search_results[idx].snippet;

    static const char bases[] = {'A','a','O','o','U','u','B'};
    char disp[BIBLE_SRCH_SNIPPET_LEN];
    {
        const char* src = snip;
        size_t di = 0;
        for (; *src && di < BIBLE_SRCH_SNIPPET_LEN - 1; src++) {
            uint8_t bc = (uint8_t)*src;
            disp[di++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *src;
        }
        disp[di] = 0;
    }
    char qdisp[BIBLE_SEARCH_QUERY_LEN];
    {
        const char* qs = search_query;
        size_t qi = 0;
        for (; *qs && qi < BIBLE_SEARCH_QUERY_LEN - 1; qs++) {
            uint8_t bc = (uint8_t)*qs;
            qdisp[qi++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *qs;
        }
        qdisp[qi] = 0;
    }
    size_t qlen = strlen(qdisp);

    // Build the set of tokens to highlight.
    // Phrase mode: one token = the full (possibly punct-stripped) query.
    // Partial mode: one token per space-delimited word.
    // Each token is punct-stripped when srch_ignore_punct is on.
    struct Token { char s[BIBLE_SEARCH_QUERY_LEN]; size_t len; };
    Token  tokens[16];
    int    ntokens = 0;

    // Source string for splitting: qdisp (private-codes mapped to ASCII bases)
    // with punctuation stripped if needed.
    char qbase[BIBLE_SEARCH_QUERY_LEN];  // punct-stripped qdisp
    {
        size_t qi = 0;
        for (size_t i = 0; qdisp[i] && qi < BIBLE_SEARCH_QUERY_LEN - 1; i++) {
            uint8_t c = (uint8_t)qdisp[i];
            if (srch_ignore_punct && c < 0x80 && ispunct((int)c)) continue;
            qbase[qi++] = qdisp[i];
        }
        qbase[qi] = 0;
    }

    if (srch_partial_match) {
        const char* p = qbase;
        while (*p && ntokens < 16) {
            while (*p == ' ') p++;
            if (!*p) break;
            const char* ws = p;
            while (*p && *p != ' ') p++;
            size_t wl = (size_t)(p - ws);
            if (wl > 0 && wl < BIBLE_SEARCH_QUERY_LEN) {
                memcpy(tokens[ntokens].s, ws, wl);
                tokens[ntokens].s[wl] = 0;
                tokens[ntokens].len   = wl;
                ntokens++;
            }
        }
    } else {
        size_t bl = strlen(qbase);
        if (bl > 0) {
            memcpy(tokens[0].s, qbase, bl + 1);
            tokens[0].len = bl;
            ntokens = 1;
        }
    }

    tft.setTextDatum(TL_DATUM);
    int16_t sx     = PADDING;
    int16_t max_sx = row_w - PADDING;
    size_t  si     = 0;

    while (disp[si] && sx < max_sx) {
        // Try each token at position si; take the first match.
        bool   found     = false;
        size_t match_end = 0;

        for (int t = 0; t < ntokens && !found; t++) {
            const char* tok = tokens[t].s;
            size_t      tl  = tokens[t].len;
            if (tl == 0) continue;

            if (srch_ignore_punct) {
                // Skip punct in disp while consuming token chars
                size_t qi = 0, di = si;
                while (qi < tl) {
                    while (disp[di] && (uint8_t)disp[di] < 0x80 && ispunct((int)(uint8_t)disp[di]))
                        di++;
                    if (!disp[di]) break;
                    if (tolower((uint8_t)disp[di]) != tolower((uint8_t)tok[qi])) break;
                    di++; qi++;
                }
                if (qi == tl) { found = true; match_end = di; }
            } else {
                bool m = true;
                for (size_t j = 0; j < tl && m; j++) {
                    if (!disp[si + j] ||
                        tolower((uint8_t)disp[si + j]) != tolower((uint8_t)tok[j]))
                        m = false;
                }
                if (m) { found = true; match_end = si + tl; }
            }
        }

        if (found) {
            tft.setTextColor((uint16_t)0xFD20, bg_col);
            for (size_t j = si; j < match_end && sx < max_sx; j++)
                sx += tftCharUTF8(tft, (uint8_t)snip[j], sx, snip_y, 1, (uint16_t)0xFD20);
            si = match_end;
        } else {
            uint16_t text_color = sel ? fg() : dim_fg();
            tft.setTextColor(text_color, bg_col);
            sx += tftCharUTF8(tft, (uint8_t)snip[si], sx, snip_y, 1, text_color);
            si++;
        }
    }
}

// Partial redraw of search result list (no header/nav repaint).
// Uses scroll_px for sub-row pixel accuracy and a viewport to clip rows.
void BibleInterface::redrawSearchResultsContent() {
    int16_t sub_px    = (int16_t)fmodf(scroll_px, (float)srchH());
    int16_t first     = (int16_t)(scroll_px / (float)srchH());
    int16_t cTop      = (int16_t)contentY();
    int16_t cEnd      = cTop + (int16_t)contentH();

    tft.startWrite();
    tft.setViewport(0, cTop, scrW(), contentH(), false);

    // Draw each visible row (each fills its own background — no upfront clear,
    // which would cause a white/black flash between frames).
    int16_t last_bottom = cTop;
    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = cTop - sub_px + i * (int16_t)srchH();
        if (y >= cEnd || idx >= (int16_t)search_result_count) break;
        drawSearchResultRow(y, (uint16_t)idx, idx == search_res_sel);
        int16_t bot = y + (int16_t)srchH();
        if (bot > last_bottom) last_bottom = bot;
    }
    // Clear any unused space below the last row (list shorter than content zone)
    if (last_bottom < cEnd)
        tft.fillRect(0, last_bottom, (int16_t)scrW() - 6, cEnd - last_bottom, bg());

    drawScrollBar(search_result_count, visSearchItems(), first);
    tft.resetViewport();
    tft.endWrite();
}

void BibleInterface::drawSearchResults() {
    tft.fillScreen(bg());
    char hdr[32];
    if (search_result_count >= BIBLE_MAX_SEARCH_RESULTS)
        snprintf(hdr, sizeof(hdr), "%d+ Results", BIBLE_MAX_SEARCH_RESULTS);
    else
        snprintf(hdr, sizeof(hdr), "%d Results", (int)search_result_count);
    drawHeader(hdr, true);

    if (search_result_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No matches found", scrW() / 2, contentY() + 30, 2);
        drawNavBar("Back", "", "");
        return;
    }

    uint8_t vis = visSearchItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < search_result_count; i++) {
        uint16_t idx = menu_scroll + i;
        drawSearchResultRow((int16_t)(contentY() + i * srchH()), idx,
                            idx == (uint16_t)search_res_sel);
    }
    drawScrollBar(search_result_count, vis, menu_scroll);
    drawNavBar("Back", "", "View");
}

// Progress bar drawn during searchBible() — called ~every 8 KB of XML read.
// The border is drawn only on the first call (done==0) to avoid repainting gray
// over the bar interior on every update, which caused a strobing gray flash.
void BibleInterface::drawSearchProgress(uint32_t done, uint32_t total) {
    int16_t bar_x = 10;
    int16_t bar_y = (int16_t)(contentY() + contentH() / 2 + 8);
    int16_t bar_w = (int16_t)scrW() - 20;
    int16_t bar_h = 14;

    // Draw border + empty interior only once at the start
    if (done == 0) {
        tft.fillRect(bar_x - 1, bar_y - 1, bar_w + 2, bar_h + 2, dim_fg());
        tft.fillRect(bar_x, bar_y, bar_w, bar_h, bg());
    }

    // Fill from left: green up to `filled`, then bg() for the remainder.
    // Drawing in this order avoids a full-bar clear that would flash the background.
    int16_t filled = 0;
    if (total > 0) {
        filled = (int16_t)((uint32_t)bar_w * done / total);
        if (filled > bar_w) filled = bar_w;
        if (filled > 0)
            tft.fillRect(bar_x, bar_y, filled, bar_h, (uint16_t)0x07E0);
    }
    if (filled < bar_w)
        tft.fillRect(bar_x + filled, bar_y, bar_w - filled, bar_h, bg());

