H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        size_t qi = 0;
        for (const char* p = query; *p && qi < BIBLE_SEARCH_QUERY_LEN - 1; p++) {
            uint8_t c = (uint8_t)*p;
            if (c < 0x80 && ispunct((int)c)) continue;
            q2[qi++] = *p;
        }
        q2[qi] = 0;
        q = q2;
        if (!q[0]) return false;
    }

    // Inline helper: does word w[0..wl) appear anywhere in t?
    auto wordIn = [](const char* t_, const char* w, size_t wl) -> bool {
        for (size_t i = 0; t_[i]; i++) {
            bool m = true;
            for (size_t j = 0; j < wl && m; j++) {
                if (!t_[i + j]) { m = false; break; }
                uint8_t tc = (uint8_t)t_[i + j];
                uint8_t qc = (uint8_t)w[j];
                if (tc >= 0x80 || qc >= 0x80) { if (tc != qc) m = false; }
                else if (tolower((int)tc) != tolower((int)qc)) m = false;
            }
            if (m) return true;
        }
        return false;
    };

    if (srch_partial_match) {
        // Every space-delimited word in q must appear somewhere in t (any order/position)
        const char* p = q;
        while (*p) {
            while (*p == ' ') p++;
            if (!*p) break;
            const char* ws = p;
            while (*p && *p != ' ') p++;
            size_t wl = (size_t)(p - ws);
            if (wl == 0) continue;
            if (!wordIn(t, ws, wl)) return false;
        }
        return true;
    }

    // Exact phrase match
    size_t qlen = strlen(q);
    for (size_t i = 0; t[i]; i++) {
        bool match = true;
        for (size_t j = 0; j < qlen; j++) {
            if (!t[i + j]) { match = false; break; }
            uint8_t tc = (uint8_t)t[i + j];
            uint8_t qc = (uint8_t)q[j];
            if (tc >= 0x80 || qc >= 0x80) {
                if (tc != qc) { match = false; break; }
            } else {
                if (tolower((int)tc) != tolower((int)qc)) { match = false; break; }
            }
        }
        if (match) return true;
    }
    return false;
}

bool BibleInterface::searchBible(const char* query) {
    search_result_count = 0;
    search_res_sel      = 0;
    if (trans_count == 0 || !query || !query[0]) return false;

    // Show search progress screen
    tft.fillScreen(bg());
    drawHeader("Searching...", false);
    // Show query centred, rendering umlauts/ß properly
    {
        int16_t qw = textWidthUTF8(query, 2);
        int16_t qx = (int16_t)(scrW() / 2) - qw / 2;
        int16_t qy = (int16_t)(contentY() + contentH() / 2 - 20);
        tft.setTextColor(fg(), bg());
        for (const char* p = query; *p; p++)
            qx += tftCharUTF8(tft, (uint8_t)*p, qx, qy, 2, fg());
    }
    drawSearchProgress(0, 1);

    // Draw Cancel button once — stays visible; progress updates don't overlap it.
    // Geometry must match the hit-test inside the parse loop below.
    const int16_t CBTN_W = 80, CBTN_H = 26;
    const int16_t cbtn_bar_y = (int16_t)(contentY() + contentH() / 2 + 8);
    const int16_t cbtn_x     = (int16_t)(scrW() / 2) - CBTN_W / 2;
    const int16_t cbtn_y     = cbtn_bar_y + 14 + 18;  // below bar (14px) + pct-text (18px)
    tft.fillRoundRect(cbtn_x, cbtn_y, CBTN_W, CBTN_H, 4, hdr_bg());
    tft.drawRoundRect(cbtn_x, cbtn_y, CBTN_W, CBTN_H, 4, dim_fg());
    tft.setTextColor(fg(), hdr_bg());
    tft.drawCentreString("Cancel", (int16_t)(scrW() / 2), cbtn_y + (CBTN_H - 8) / 2, 1);

    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[cur_trans]);
    File f = SD.open(path);
    if (!f) return false;

    uint32_t file_size = (uint32_t)f.size();
    uint32_t last_upd  = 0;

    // Dictionary: only scan the letter-bucket book whose code matches the first
    // character of the query — seek straight to it and stop at the next book.
    // (Turns a 100+ MB full-file scan into a quick few-MB range scan.)
    uint16_t dict_bucket = 0xFFFF;
    uint32_t prog_base = 0, prog_total = file_size;
    if (mode == MODE_DICT) {
        char code[12];
        dictBucketCode(query[0], code);
        for (uint16_t b = 0; b < numBooks(); b++) {
            if (strcmp(bookCode(b), code) == 0) { dict_bucket = b; break; }
        }
        if (dict_bucket == 0xFFFF || dict_bucket >= book_offsets_cap) {
            f.close();
            drawSearchProgress(1, 1);   // no bucket for this letter → zero results
            return true;
        }
        uint32_t start = book_offsets[dict_bucket];
        uint32_t next  = (dict_bucket + 1 < numBooks()) ? book_offsets[dict_bucket + 1] : file_size;
        f.seek(start);
        last_upd   = start;
        prog_base  = start;
        prog_total = (next > start) ? (next - start) : 1;
    }

    XmlState s;
    memset(&s, 0, sizeof(s));
    s.f = f;

    enum { ST_TEXT, ST_TAG } st = ST_TEXT;
    char tag_buf[XML_TAG_BUF];
    int  tag_len      = 0;
    bool in_verse     = false;
    bool in_note      = false;
    char vtext[BIBLE_VERSE_BUF];
    int  vtext_len    = 0;
    uint16_t vs_book  = 0, vs_chap = 0;
    uint8_t  vs_verse = 0;
    char c;

    while (xmlNextByte(s, c)) {
        uint32_t pos = (uint32_t)f.position();
        if (pos - last_upd >= 8192) {
            last_upd = pos;
            drawSearchProgress(pos - prog_base, prog_total);
            yield();
            // Cancel only if user taps the Cancel button
            {
                uint16_t cx, cy;
                if (pollTouch(&cx, &cy) &&
                    (int16_t)cx >= cbtn_x && (int16_t)cx < cbtn_x + CBTN_W &&
                    (int16_t)cy >= cbtn_y && (int16_t)cy < cbtn_y + CBTN_H) {
                    f.close();
                    search_result_count = 0;
                    needs_redraw = true;
                    return false;
                }
            }
        }

        if (st == ST_TEXT) {
            if (c == '<') { st = ST_TAG; tag_len = 0; continue; }
            if (in_verse && !in_note && vtext_len < BIBLE_VERSE_BUF - 2)
                vtext[vtext_len++] = c;
        } else {
            if (c == '>') {
                st = ST_TEXT;
                tag_buf[tag_len] = 0;

