H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
                bool closing = (tag_buf[0] == '/');
                const char* tname = closing ? tag_buf + 1 : tag_buf;

                if (tag_buf[0] == '?' || tag_buf[0] == '!') {
                    tag_len = 0; continue;
                }

                if (!closing) {
                    bool self_close = (tag_len > 0 && tag_buf[tag_len - 1] == '/');
                    if (self_close) tag_buf[--tag_len] = 0;

                    if (strncmp(tname, "verse", 5) == 0 &&
                        (tname[5] == ' ' || tname[5] == '\t' || tname[5] == 0)) {
                        char osis_id[64] = {0};
                        if (xmlGetAttr(tag_buf, "osisID", osis_id, sizeof(osis_id))) {
                            uint16_t bk = 0, ch = 0;
                            uint8_t  vs = 0;
                            if (parseOsisID(osis_id, bk, ch, vs)) {
                                // Dictionary: we seeked to one letter-bucket book.
                                // Once a verse from a later book appears, we're done.
                                if (mode == MODE_DICT && bk != dict_bucket) break;
                                // Scope filter (Bible/Songs): skip verses outside scope.
                                // (Dictionary's "scope" is the letter bucket above.)
                                bool in_scope = true;
                                if (mode != MODE_DICT) {
                                    if (srch_scope == 1)
                                        in_scope = (bookSection(bk) == cur_sec);
                                    else if (srch_scope == 2)
                                        in_scope = (bk == cur_book);
                                }
                                if (in_scope) {
                                    vs_book   = bk;
                                    vs_chap   = ch;
                                    vs_verse  = vs;
                                    in_verse  = !self_close;
                                    in_note   = false;
                                    vtext_len = 0;
                                } else {
                                    in_verse  = false;
                                }
                            }
                        }
                    } else if (in_verse) {
                        if (strncmp(tname, "note", 4) == 0) in_note = true;
                    }
                } else {
                    if (strncmp(tname, "verse", 5) == 0 && in_verse) {
                        vtext[vtext_len] = 0;
                        xmlDecodeEntities(vtext, BIBLE_VERSE_BUF);
                        utf8Encode(vtext);
                        if (searchContains(vtext, query) &&
                            search_result_count < BIBLE_MAX_SEARCH_RESULTS) {
                            BibleSearchResult r;
                            r.book    = vs_book;
                            r.chapter = vs_chap;
                            r.verse   = vs_verse;
                            // Store snippet centered on first match occurrence
                            {
                                size_t qlen2 = strlen(query);
                                size_t tlen2 = (size_t)vtext_len;
                                size_t match_pos = 0;
                                for (size_t si = 0; si + qlen2 <= tlen2; si++) {
                                    bool m = true;
                                    for (size_t sj = 0; sj < qlen2 && m; sj++) {
                                        uint8_t tc = (uint8_t)vtext[si + sj];
                                        uint8_t qc = (uint8_t)query[sj];
                                        if (tc >= 0x80 || qc >= 0x80) { if (tc != qc) m = false; }
                                        else if (tolower((int)tc) != tolower((int)qc)) m = false;
                                    }
                                    if (m) { match_pos = si; break; }
                                }
                                size_t half = (BIBLE_SRCH_SNIPPET_LEN - 1) / 2;
                                size_t snip_start = (match_pos > half) ? match_pos - half : 0;
                                strncpy(r.snippet, vtext + snip_start, BIBLE_SRCH_SNIPPET_LEN - 1);
                                r.snippet[BIBLE_SRCH_SNIPPET_LEN - 1] = 0;
                            }
                            search_results[search_result_count++] = r;
                        }
                        in_verse  = false;
                        in_note   = false;
                        vtext_len = 0;
                    } else if (in_verse) {
                        if (strncmp(tname, "note", 4) == 0) in_note = false;
                    }
                }
                tag_len = 0;
            } else {
                if (tag_len < XML_TAG_BUF - 1)
                    tag_buf[tag_len++] = c;
            }
        }
    }
    f.close();
    // Final progress bar fill
    drawSearchProgress(prog_total, prog_total);
    return true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — history persistence
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::addToSearchHistory(const char* query) {
    if (!query || !query[0]) return;
    // Deduplicate: if already present, move to front
    for (uint8_t i = 0; i < search_hist_count; i++) {
        if (strcmp(search_hist[i], query) == 0) {
            for (uint8_t j = i; j > 0; j--)
                memcpy(search_hist[j], search_hist[j - 1], BIBLE_SEARCH_QUERY_LEN);
            strncpy(search_hist[0], query, BIBLE_SEARCH_QUERY_LEN - 1);
            search_hist[0][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
            saveSearchHistory();
            return;
        }
    }
    // Insert at front, shifting existing entries (oldest drops off if full)
    uint8_t new_count = (search_hist_count < BIBLE_SEARCH_HIST_MAX)
                        ? search_hist_count + 1
                        : BIBLE_SEARCH_HIST_MAX;
    for (uint8_t i = new_count - 1; i > 0; i--)
        memcpy(search_hist[i], search_hist[i - 1], BIBLE_SEARCH_QUERY_LEN);
    strncpy(search_hist[0], query, BIBLE_SEARCH_QUERY_LEN - 1);
    search_hist[0][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
    search_hist_count = new_count;
    saveSearchHistory();
}

void BibleInterface::saveSearchHistory() {
    char path[64];
    srchHistPath(path, sizeof(path));
    SD.remove(path);
    File f = SD.open(path, FILE_WRITE);
    if (!f) return;
    for (uint8_t i = 0; i < search_hist_count; i++) {
        f.print(search_hist[i]);
        f.write('\n');
    }
    f.close();
}

void BibleInterface::loadSearchHistory() {
    search_hist_count = 0;
    char path[64];
    srchHistPath(path, sizeof(path));
    File f = SD.open(path);
    if (!f) return;
    while (f.available() && search_hist_count < BIBLE_SEARCH_HIST_MAX) {
        String line = f.readStringUntil('\n');
        line.trim();
        if (line.length() == 0 || line.length() >= BIBLE_SEARCH_QUERY_LEN) continue;
        strncpy(search_hist[search_hist_count], line.c_str(), BIBLE_SEARCH_QUERY_LEN - 1);
        search_hist[search_hist_count][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
        search_hist_count++;
    }
    f.close();
}

// ─────────────────────────────────────────────────────────────────────────────
// OTA — switch boot partition to Marauder (ota_1) and restart
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::bootMarauder() {
    const esp_partition_t* ota1 = esp_partition_find_first(
        ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_1, nullptr);
    if (ota1) {
        Serial.println(F("[Bible] Switching to Marauder (ota_1)..."));
        esp_ota_set_boot_partition(ota1);
        delay(200);
        esp_restart();
    } else {
        Serial.println(F("[Bible] ota_1 partition not found!"));
        tft.fillRect(0, contentY() + 40, scrW(), 30, TFT_RED);
        tft.setTextColor(TFT_WHITE, TFT_RED);
        tft.drawCentreString("ota_1 not found!", scrW()/2, contentY() + 48, 2);
        delay(2000);
        needs_redraw = true;
    }
}

#endif  // HAS_SCREEN
